# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
data=[4,8,15,16,23,42]

In [2]:
series=pd.Series(data)

In [3]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
list=[1,2,3,4,5,6,7,8,9,11]

In [5]:
print(pd.Series(list))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    11
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
data={' Name':['Alice','Bob','Clair'], 'Age':[25,30,27], 'Gender':['Female','Male','Female']
}

In [10]:
df=pd.DataFrame(data)

In [11]:
print(df)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans:
    DataFrame:

Structure: A two-dimensional, size-mutable, tabular data structure with labeled rows and columns.
Resembles: Spreadsheets or SQL tables, with flexible data types across columns.
Building blocks: Internally composed of Series objects (one for each column).
Common operations: Selection, filtering, sorting, grouping, aggregation, merging, joining, and more.

In [1]:
import pandas as pd
data={
'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}


df=pd.DataFrame(data)

In [2]:
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

Series:
    Structure: A one-dimensional, size-immutable, labeled array capable of holding any data type.
Essentially: A single column of a DataFrame.
Common operations: Arithmetic operations, alignment, element selection, missing value handling, etc.

In [4]:
import pandas as pd
series=pd.Series(['neha','shweta','abhi','anvi'])
print(series)

0      neha
1    shweta
2      abhi
3      anvi
dtype: object

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans.Here are some common functions for manipulating data in Pandas DataFrames, along with examples:

In [6]:
df.head(1) # View the first few rows (default: 5

    Name  Age      City
0  Alice   25  New York

In [7]:
df.tail(1) #View the last few rows

      Name  Age   City
2  Charlie   35  Paris

In [9]:
df.shape #gives rows and coloumns

(3, 3)

In [10]:
df.info() # Overview of data types and non-null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [11]:
df.describe() # Summary statistics for numerical columns.

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [13]:
df.sort_values('Age',ascending=True)# Sort by one or more columns

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [14]:
df.drop(columns=['Age']) #drop the coloumn or rows

      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Paris

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. 
Mutability refers to the ability to change the size or content of a data structure after it's created.

Mutable Data Structures are :

1.DataFrame
2.Panel

# Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans.

In [16]:
import pandas as pd

In [18]:
name_series=pd.Series['NEHA',"ABHI","ANVIKA",'SHWETA']
age_series=pd.Series['22','2','2','22']
city_series=pd.Series['bammath','parbhani','nanded','wadi']
data={'name':name_series,'Age':age_series,'City':city_series
}
df=pd.DataFrame(data)

TypeError: 'type' object is not subscriptable